Revit 2024 API
GlobalParameter.CanChangeReporting Method
 Tests whether the global parameter permits a change of its current value of the IsReporting attribute.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool CanChangeReporting()
Visual Basic
Public Function CanChangeReporting As Boolean
Visual C++
public:
bool CanChangeReporting()
Return Value
 Returns True if the change is allowed; False otherwise.
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace